Repository: yasircs4/wp-plg-arabic-search-enhancement
Catalog: languages/arabic-search-enhancement-*.po
Languages: ar

source: Arabic Search Settings
ar: إعدادات البحث العربي

source: Arabic Search
ar: البحث العربي

source: Enable Arabic Enhancement
ar: تفعيل تحسين البحث العربي

source: Enable Arabic text normalization in search
ar: تفعيل توحيد النصوص العربية في البحث

source: When enabled, searches will find content with different Arabic letter forms (e.g., searching "قران" will find "قرآن")
ar: عند التفعيل، ستجد عمليات البحث المحتوى بأشكال حروف عربية مختلفة (مثلاً، البحث عن "قران" سيجد "قرآن")

source: Search in Excerpt
ar: البحث في المقتطف

source: Include post excerpts in search
ar: تضمين مقتطفات المشاركات في البحث

source: Post Types to Search
ar: أنواع المشاركات للبحث

source: No public post types available.
ar: لا توجد أنواع مشاركات عامة متاحة.

source: Select which post types to include in search results
ar: اختر أنواع المشاركات المراد تضمينها في نتائج البحث

source: Results Per Page
ar: النتائج في كل صفحة

source: Number of search results to show per page
ar: عدد نتائج البحث المراد إظهارها في كل صفحة

source: Debug Mode
ar: وضع التشخيص

source: Enable debug logging
ar: تفعيل سجل التشخيص

source: Log errors and performance information for troubleshooting
ar: تسجيل الأخطاء ومعلومات الأداء لاستكشاف الأخطاء

source: Normalization Rules
ar: قواعد التوحيد

source: This plugin automatically normalizes the following Arabic text variations:
ar: هذا المكون الإضافي يوحد تلقائياً تنويعات النصوص العربية التالية:

source: Removes all diacritics (Tashkeel): َ ُ ِ ّ ْ ً ٌ ٍ and more
ar: يزيل جميع علامات التشكيل: َ ُ ِ ّ ْ ً ٌ ٍ وأكثر

source: Normalizes Alef: أ إ آ ٱ → ا
ar: يوحد الألف: أ إ آ ٱ → ا

source: Normalizes Taa Marbuta: ة → ه
ar: يوحد التاء المربوطة: ة → ه

source: Normalizes Yaa: ى → ي
ar: يوحد الياء: ى → ي

source: Normalizes Hamza: ؤ → و, ئ → ي
ar: يوحد الهمزة: ؤ → و, ئ → ي

source: Removes Tatweel (Kashida): ـ
ar: يزيل التطويل (الكشيدة): ـ

source: Test Your Search
ar: اختبر البحث

source: Try searching for these examples to see the improvement:
ar: جرب البحث عن هذه الأمثلة لترى التحسن:

source: Search "قران" to find "قرآن"
ar: ابحث عن "قران" لتجد "قرآن"

source: Search "اسلام" to find "إسلام" or "الإسلام"
ar: ابحث عن "اسلام" لتجد "إسلام" أو "الإسلام"

source: Search "محمد" to find "مُحَمَّد" (with diacritics)
ar: ابحث عن "محمد" لتجد "مُحَمَّد" (مع التشكيل)

source: Search "سنه" to find "سنة"
ar: ابحث عن "سنه" لتجد "سنة"

source: Plugin Information
ar: معلومات المكون الإضافي

source: Version:
ar: الإصدار:

source: Website:
ar: الموقع الإلكتروني:

source: Database Charset:
ar: ترميز قاعدة البيانات:

source: Database Collation:
ar: ترتيب قاعدة البيانات:

source: Settings
ar: الإعدادات

source: Plugin Self-Test
ar: اختبار المكون الإضافي الذاتي

source: Click the button below to run a comprehensive test of the plugin functionality.
ar: انقر على الزر أدناه لتشغيل اختبار شامل لوظائف المكون الإضافي.

source: Run Self-Test
ar: تشغيل الاختبار الذاتي

source: Test Results:
ar: نتائج الاختبار:

source: Running Tests...
ar: تشغيل الاختبارات...

source: Note: Server-side tests require the plugin to be fully activated and functional.
ar: ملاحظة: اختبارات الخادم تتطلب تفعيل المكون الإضافي وعمله بشكل كامل.

source: Arabic Search Enhancement requires PHP 7.4 or higher. Your version:
ar: تحسين البحث العربي يتطلب PHP 7.4 أو أحدث. إصدارك:

source: Arabic Search Enhancement requires WordPress 5.0 or higher.
ar: تحسين البحث العربي يتطلب WordPress 5.0 أو أحدث.

source: Arabic Search Enhancement requires WordPress function %s which is not available.
ar: تحسين البحث العربي يتطلب دالة WordPress %s التي غير متاحة.

source: Arabic Search Enhancement: Failed to initialize autoloader.
ar: تحسين البحث العربي: فشل في تهيئة محمل الفئات.

source: Arabic Search Enhancement: Failed to initialize plugin.
ar: تحسين البحث العربي: فشل في تهيئة المكون الإضافي.

source: Arabic Search Enhancement initialization error: %s
ar: خطأ في تهيئة تحسين البحث العربي: %s

source: Arabic Search Enhancement cannot be activated due to unmet requirements.
ar: لا يمكن تفعيل تحسين البحث العربي بسبب عدم توفر المتطلبات.

source: Plugin Activation Error
ar: خطأ في تفعيل المكون الإضافي

source: Arabic Search Enhancement: Essential plugin classes could not be loaded.
ar: تحسين البحث العربي: لا يمكن تحميل فئات المكون الإضافي الأساسية.

source: Arabic Search Enhancement activation failed: %s
ar: فشل تفعيل تحسين البحث العربي: %s
